Masmiseim36/nxpSDK/devices/MIMXRT117H/gcc/startup_MIMXRT117H_cm7.c
WEAK void DMA14_DMA30_IRQHandler(void)
{
    DMA14_DMA30_DriverIRQHandler();
}

WEAK void DMA15_DMA31_IRQHandler(void)
{
    DMA15_DMA31_DriverIRQHandler();
}

WEAK void DMA_ERROR_IRQHandler(void)
{
    DMA_ERROR_DriverIRQHandler();
}

WEAK void CTI_TRIGGER_OUT0_IRQHandler(void)
{
    CTI_TRIGGER_OUT0_DriverIRQHandler();
}

WEAK void CTI_TRIGGER_OUT1_IRQHandler(void)
{
    CTI_TRIGGER_OUT1_DriverIRQHandler();
}

WEAK void CORE_IRQHandler(void)
{
    CORE_DriverIRQHandler();
}

WEAK void LPUART1_IRQHandler(void)
{
    LPUART1_DriverIRQHandler();
}

WEAK void LPUART2_IRQHandler(void)
{
    LPUART2_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{
    LPUART3_DriverIRQHandler();
}

WEAK void LPUART4_IRQHandler(void)
{
    LPUART4_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{
    LPUART5_DriverIRQHandler();
}

WEAK void LPUART6_IRQHandler(void)
{
    LPUART6_DriverIRQHandler();
}

WEAK void LPUART7_IRQHandler(void)
{
    LPUART7_DriverIRQHandler();
}

WEAK void LPUART8_IRQHandler(void)
{
    LPUART8_DriverIRQHandler();
}

WEAK void LPUART9_IRQHandler(void)
{
    LPUART9_DriverIRQHandler();
}

WEAK void LPUART10_IRQHandler(void)
{
    LPUART10_DriverIRQHandler();
}

WEAK void LPUART11_IRQHandler(void)
{
    LPUART11_DriverIRQHandler();
}

WEAK void LPUART12_IRQHandler(void)
{
    LPUART12_DriverIRQHandler();
}

WEAK void LPI2C1_IRQHandler(void)
{
    LPI2C1_DriverIRQHandler();
}

WEAK void LPI2C2_IRQHandler(void)
{
    LPI2C2_DriverIRQHandler();
}

WEAK void LPI2C3_IRQHandler(void)
{
    LPI2C3_DriverIRQHandler();
}

WEAK void LPI2C4_IRQHandler(void)
{
    LPI2C4_DriverIRQHandler();
}

WEAK void LPI2C5_IRQHandler(void)
{
    LPI2C5_DriverIRQHandler();
}

WEAK void LPI2C6_IRQHandler(void)
{
    LPI2C6_DriverIRQHandler();
}

WEAK void LPSPI1_IRQHandler(void)
{
    LPSPI1_DriverIRQHandler();
}

WEAK void LPSPI2_IRQHandler(void)
{
    LPSPI2_DriverIRQHandler();
}

WEAK void LPSPI3_IRQHandler(void)
{
    LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{
    LPSPI4_DriverIRQHandler();
}

WEAK void LPSPI5_IRQHandler(void)
{
    LPSPI5_DriverIRQHandler();
}

WEAK void LPSPI6_IRQHandler(void)
{
    LPSPI6_DriverIRQHandler();
}

WEAK void CAN1_IRQHandler(void)
{
    CAN1_DriverIRQHandler();
}

WEAK void CAN1_ERROR_IRQHandler(void)
{
    CAN1_ERROR_DriverIRQHandler();
}

WEAK void CAN2_IRQHandler(void)
{
    CAN2_DriverIRQHandler();
}

WEAK void CAN2_ERROR_IRQHandler(void)
{
    CAN2_ERROR_DriverIRQHandler();
}

WEAK void CAN3_IRQHandler(void)
{
    CAN3_DriverIRQHandler();
}

WEAK void CAN3_ERROR_IRQHandler(void)
{
    CAN3_ERROR_DriverIRQHandler();
}

WEAK void FLEXRAM_IRQHandler(void)
{
    FLEXRAM_DriverIRQHandler();
}

WEAK void KPP_IRQHandler(void)
{
    KPP_DriverIRQHandler();
}

WEAK void Reserved68_IRQHandler(void)
{
    Reserved68_DriverIRQHandler();
}

WEAK void GPR_IRQ_IRQHandler(void)
{
    GPR_IRQ_DriverIRQHandler();
}

WEAK void eLCDIF_IRQHandler(void)
{
    eLCDIF_DriverIRQHandler();
}

WEAK void LCDIFv2_IRQHandler(void)
{
    LCDIFv2_DriverIRQHandler();
}

WEAK void CSI_IRQHandler(void)
{
    CSI_DriverIRQHandler();
}

WEAK void PXP_IRQHandler(void)
{
    PXP_DriverIRQHandler();
}

WEAK void MIPI_CSI_IRQHandler(void)
{
    MIPI_CSI_DriverIRQHandler();
}

WEAK void MIPI_DSI_IRQHandler(void)
{
    MIPI_DSI_DriverIRQHandler();
}

WEAK void GPU2D_IRQHandler(void)
{
    GPU2D_DriverIRQHandler();
}

WEAK void GPIO6_Combined_0_15_IRQHandler(void)
{
    GPIO6_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO6_Combined_16_31_IRQHandler(void)
{
    GPIO6_Combined_16_31_DriverIRQHandler();
}

WEAK void DAC_IRQHandler(void)
{
    DAC_DriverIRQHandler();
}

WEAK void KEY_MANAGER_IRQHandler(void)
{
    KEY_MANAGER_DriverIRQHandler();
}

WEAK void WDOG2_IRQHandler(void)
{
    WDOG2_DriverIRQHandler();
}

WEAK void SNVS_HP_NON_TZ_IRQHandler(void)
{
    SNVS_HP_NON_TZ_DriverIRQHandler();
}

WEAK void SNVS_HP_TZ_IRQHandler(void)
{
    SNVS_HP_TZ_DriverIRQHandler();
}

WEAK void SNVS_PULSE_EVENT_IRQHandler(void)
{
    SNVS_PULSE_EVENT_DriverIRQHandler();
}

WEAK void CAAM_IRQ0_IRQHandler(void)
{
    CAAM_IRQ0_DriverIRQHandler();
}

WEAK void CAAM_IRQ1_IRQHandler(void)
{
    CAAM_IRQ1_DriverIRQHandler();
}

WEAK void CAAM_IRQ2_IRQHandler(void)
{
    CAAM_IRQ2_DriverIRQHandler();
}

WEAK void CAAM_IRQ3_IRQHandler(void)
{
    CAAM_IRQ3_DriverIRQHandler();
}

WEAK void CAAM_RECORVE_ERRPR_IRQHandler(void)
{
    CAAM_RECORVE_ERRPR_DriverIRQHandler();
}

WEAK void CAAM_RTIC_IRQHandler(void)
{
    CAAM_RTIC_DriverIRQHandler();
}

WEAK void CDOG_IRQHandler(void)
{
    CDOG_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{
    SAI1_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{
    SAI2_DriverIRQHandler();
}

WEAK void SAI3_RX_IRQHandler(void)
{
    SAI3_RX_DriverIRQHandler();
}

WEAK void SAI3_TX_IRQHandler(void)
{
    SAI3_TX_DriverIRQHandler();
}

WEAK void SAI4_RX_IRQHandler(void)
{
    SAI4_RX_DriverIRQHandler();
}

WEAK void SAI4_TX_IRQHandler(void)
{
    SAI4_TX_DriverIRQHandler();
}

WEAK void SPDIF_IRQHandler(void)
{
    SPDIF_DriverIRQHandler();
}

WEAK void TMPSNS_INT_IRQHandler(void)
{
    TMPSNS_INT_DriverIRQHandler();
}

WEAK void TMPSNS_LOW_HIGH_IRQHandler(void)
{
    TMPSNS_LOW_HIGH_DriverIRQHandler();
}

WEAK void TMPSNS_PANIC_IRQHandler(void)
{
    TMPSNS_PANIC_DriverIRQHandler();
}

WEAK void LPSR_LP8_BROWNOUT_IRQHandler(void)
{
    LPSR_LP8_BROWNOUT_DriverIRQHandler();
}

WEAK void LPSR_LP0_BROWNOUT_IRQHandler(void)
{
    LPSR_LP0_BROWNOUT_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{
    ADC2_DriverIRQHandler();
}

WEAK void USBPHY1_IRQHandler(void)
{
    USBPHY1_DriverIRQHandler();
}

WEAK void USBPHY2_IRQHandler(void)
{
    USBPHY2_DriverIRQHandler();
}

WEAK void RDC_IRQHandler(void)
{
    RDC_DriverIRQHandler();
}

WEAK void GPIO13_Combined_0_31_IRQHandler(void)
{
    GPIO13_Combined_0_31_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

WEAK void DCIC1_IRQHandler(void)
{
    DCIC1_DriverIRQHandler();
}

WEAK void DCIC2_IRQHandler(void)
{
    DCIC2_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{
    ASRC_DriverIRQHandler();
}

WEAK void FLEXRAM_ECC_IRQHandler(void)
{
    FLEXRAM_ECC_DriverIRQHandler();
}

